# Prot_GetLicenseType

## Description
Returns the license type Vectorworks is using.

```pascal
FUNCTION Prot_GetLicenseType : LONGINT;
```

```python

def vs.Prot_GetLicenseType():
    return LONGINT
```

## Version
Availability: from Vectorworks 2023
## Category
* Protection